# Pandas -- "Excel für Python, aber besser"

* Series
* DataFrame
* Daten-Auswahl
* Benutzerdefinierte Auswahl
* Data Input und Output
* Abwesende Daten
* GroupBy
* Merging, Joining, Concatenation
* Operations

Installation (in Anaconda schon inbegriffen)

    conda install pandas
oder
    
    pip install pandas

# Series

Series ist ein Datentyp von Pandas, um Reiehenfolgen-Artige Data (wie Time-Series) zu behandeln.

Series kann man aus Python List, Numpy Array, Python Dictionary erstellen.

In [2]:
import pandas as pd

pd.Series([10, 20, 30, 40, 50])

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
import numpy as np

pd.Series(np.array([10, 20, 30, 40, 50]))

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [3]:
md = {'a': 10, 'b': 20, 'c': 30, 'd': 40, 'e': 50}

pd.Series(md)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [4]:
labels = ['n', 'k', 'j', 'x', 'y']

pd.Series([10, 20, 30, 40, 50], index=labels)

n    10
k    20
j    30
x    40
y    50
dtype: int64

Indices ermöglichen schnellen Zugriff zu Daten

In [5]:
data = [43, 12, 54, 12, 56]
labels = ['KY', 'NY', 'OR', 'WY', 'AL']
s1 = pd.Series(data, labels)
s1

KY    43
NY    12
OR    54
WY    12
AL    56
dtype: int64

In [6]:
data = [65, 34, 56, 23, 56]
labels = ['KY', 'WY', 'FL', 'TN', 'AL']
s2 = pd.Series(data, labels)
s2

KY    65
WY    34
FL    56
TN    23
AL    56
dtype: int64

In [20]:
s3 = s1 + s2; s3

AL    112.0
FL      NaN
KY    108.0
NY      NaN
OR      NaN
TN      NaN
WY     46.0
dtype: float64

### Series können beliebige Daten enthalten

### Abwesende Werte in Series

In [29]:
s3.dropna(inplace=False)

AL    112.0
KY    108.0
WY     46.0
dtype: float64

In [31]:
s3

AL    112.0
FL      NaN
KY    108.0
NY      NaN
OR      NaN
TN      NaN
WY     46.0
dtype: float64

In [32]:
s3.fillna(0.0)

AL    112.0
FL      0.0
KY    108.0
NY      0.0
OR      0.0
TN      0.0
WY     46.0
dtype: float64

In [ ]:
s3.fillna(s3.mean())

In [37]:
s3.head(2)

AL    112.0
FL      NaN
dtype: float64

In [35]:
s3.tail()

KY    108.0
NY      NaN
OR      NaN
TN      NaN
WY     46.0
dtype: float64

# DataFrame

In [38]:
from numpy.random import randn
import pandas as pd

df = pd.DataFrame(randn(5, 4), columns='A B C D'.split(), index='WY KY WS AL FL'.split()); df

           A         B         C         D
WY -0.295598 -0.446567 -0.196448  1.303685
KY -0.365105 -0.725048  0.650752  0.317721
WS -0.910884 -0.703976  0.320993 -0.152861
AL -0.310119  1.801487 -0.145795  1.226468
FL  0.519044  0.230875  1.152704  0.395930

### Daten-Auswahl

In [39]:
df['A']

WY   -0.295598
KY   -0.365105
WS   -0.910884
AL   -0.310119
FL    0.519044
Name: A, dtype: float64

In [40]:
df['A']['WY']

-0.29559757984054774

In [41]:
df[['A', 'B']]

           A         B
WY -0.295598 -0.446567
KY -0.365105 -0.725048
WS -0.910884 -0.703976
AL -0.310119  1.801487
FL  0.519044  0.230875

In [42]:
df.loc['WY']

A   -0.295598
B   -0.446567
C   -0.196448
D    1.303685
Name: WY, dtype: float64

In [43]:
df.loc['WY']['A']

-0.29559757984054774

Achtung, eine Falle: wenn man statt 'loc[]' versucht 'loc()' anzuwenden, werden nicht die Daten, sondern 'loc()' Object zurückgegeben

In [44]:
df.loc['WY', 'A']

-0.29559757984054774

Achtung, eine Falle: ein Subset von den Daten kann man mit df.loc[] bekommen, aber nicht mit dem Auswahl aus dem DataFrame Objekt selbst, wie df[['WY', 'KY'], ['A', 'B']]

In [49]:
type(df.loc[['WY', 'KY'], ['A', 'B']])

pandas.core.frame.DataFrame

.iloc() -- Datenreihe nach Position suchen

In [46]:
df

           A         B         C         D
WY -0.295598 -0.446567 -0.196448  1.303685
KY -0.365105 -0.725048  0.650752  0.317721
WS -0.910884 -0.703976  0.320993 -0.152861
AL -0.310119  1.801487 -0.145795  1.226468
FL  0.519044  0.230875  1.152704  0.395930

In [47]:
df.iloc[0]

A   -0.295598
B   -0.446567
C   -0.196448
D    1.303685
Name: WY, dtype: float64

In [50]:
df.iloc[0][['A', 'B']]

A   -0.295598
B   -0.446567
Name: WY, dtype: float64

# Benutzerdefinierte Auswahl

In [51]:
df

           A         B         C         D
WY -0.295598 -0.446567 -0.196448  1.303685
KY -0.365105 -0.725048  0.650752  0.317721
WS -0.910884 -0.703976  0.320993 -0.152861
AL -0.310119  1.801487 -0.145795  1.226468
FL  0.519044  0.230875  1.152704  0.395930

In [52]:
df > 0

        A      B      C      D
WY  False  False  False   True
KY  False  False   True   True
WS  False  False   True  False
AL  False   True  False   True
FL   True   True   True   True

In [60]:
(df['D']>0).value_counts()

True     4
False    1
Name: D, dtype: int64

In [53]:
df[df > 0]

           A         B         C         D
WY       NaN       NaN       NaN  1.303685
KY       NaN       NaN  0.650752  0.317721
WS       NaN       NaN  0.320993       NaN
AL       NaN  1.801487       NaN  1.226468
FL  0.519044  0.230875  1.152704  0.395930

In [54]:
df[df['D'] > 0]

           A         B         C         D
WY -0.295598 -0.446567 -0.196448  1.303685
KY -0.365105 -0.725048  0.650752  0.317721
AL -0.310119  1.801487 -0.145795  1.226468
FL  0.519044  0.230875  1.152704  0.395930

In [61]:
df[(df['D'] > 0) & (df['B'] < 0)]

           A         B         C         D
WY -0.295598 -0.446567 -0.196448  1.303685
KY -0.365105 -0.725048  0.650752  0.317721

Achtung: nur binäre Operatoren verwenden (|, &, ~), keine or/and! ()s sind notwendig

# Group by

In [62]:
import pandas as pd

data = {'Company':['GOOG','FB','MSFT','MSFT','GOOG','FB'],
       'Person':['Bob','Charlie','Sam','Vanessa','Charlie','Alice'],
       'Sales':[300,100,300,224,113,351]}

df = pd.DataFrame(data)

df

  Company   Person  Sales
0    GOOG      Bob    300
1      FB  Charlie    100
2    MSFT      Sam    300
3    MSFT  Vanessa    224
4    GOOG  Charlie    113
5      FB    Alice    351

In [63]:
df.groupby('Company').mean()

         Sales
Company
FB       225.5
GOOG     206.5
MSFT     262.0

In [ ]:
df.groupby('Company').mean()

In [64]:
df.groupby('Company').std()

              Sales
Company
FB       177.483802
GOOG     132.228968
MSFT      53.740115

In [65]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [68]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  225.5  177.483802  100.0  162.75  225.5  288.25  351.0
GOOG      2.0  206.5  132.228968  113.0  159.75  206.5  253.25  300.0
MSFT      2.0  262.0   53.740115  224.0  243.00  262.0  281.00  300.0

# Operations

In [69]:
import pandas as pd
df = pd.DataFrame({'A':[1,2,3,4],'B':[444,555,666,444],'C':['abc','def','ghi','xyz']})
df.head()

   A    B    C
0  1  444  abc
1  2  555  def
2  3  666  ghi
3  4  444  xyz

In [74]:
df['B'].nunique()

3

In [73]:
df['B'].count() - df['B'].nunique()

1

In [75]:
df['B'].value_counts()

444    2
555    1
666    1
Name: B, dtype: int64

In [78]:
df['Q'] = df['B'].apply(lambda n: n**3)

In [79]:
df

   A    B    C          Q
0  1  444  abc   87528384
1  2  555  def  170953875
2  3  666  ghi  295408296
3  4  444  xyz   87528384

In [80]:
del df['Q']
df

   A    B    C
0  1  444  abc
1  2  555  def
2  3  666  ghi
3  4  444  xyz

In [83]:
df.sort_values(by=['B', 'C'], ascending=[False, True])

   A    B    C
2  3  666  ghi
1  2  555  def
0  1  444  abc
3  4  444  xyz

# Data Input und Output

### Aus Web: pandas entziffert HTML-Tabellen selbständig

In [84]:
tables = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html'); 

df = tables[0]

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 553 entries, 0 to 552
Data columns (total 7 columns):
Bank Name                553 non-null object
City                     553 non-null object
ST                       553 non-null object
CERT                     553 non-null int64
Acquiring Institution    553 non-null object
Closing Date             553 non-null object
Updated Date             553 non-null object
dtypes: int64(1), object(6)
memory usage: 30.3+ KB

In [91]:
df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","June 1, 2017"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","June 1, 2017"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","May 23, 2017"
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","May 18, 2017"
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","May 18, 2017"

In [96]:
df.groupby('CERT').describe()

      Acquiring Institution         \
                      count unique
CERT
91                        1      1
151                       1      1
182                       1      1
416                       1      1
513                       1      1
916                       1      1
1006                      1      1
1056                      1      1
1249                      1      1
1252                      1      1
1361                      1      1
1690                      1      1
1802                      1      1
1909                      1      1
1971                      1      1
2119                      1      1
2303                      1      1
2994                      1      1
3287                      1      1
3644                      1      1
3731                      1      1
3735                      1      1
3815                      1      1
4077                      1      1
4392                      1      1
4614                      1      1
4731                      1      1
4744                      1      1
4754                      1      1
4862                      1      1
...                     ...    ...
58072                     1      1
58073                     1      1
58087                     1      1
58104                     1      1
58125                     1      1
58182                     1      1
58185                     1      1
58197                     1      1
58205                     1      1
58222                     1      1
58226                     1      1
58238                     1      1
58241                     1      1
58273                     1      1
58283                     1      1
58302                     1      1
58308                     1      1
58315                     1      1
58336                     1      1
58343                     1      1
58352                     1      1
58358                     1      1
58362                     1      1
58399                     1      1
58420                     1      1
58429                     1      1
58495                     1      1
58531                     1      1
58539                     1      1
58701                     1      1

                                                        Bank Name         \
                                               top freq     count unique
CERT
91                                    Today's Bank    1         1      1
151                      SCBT National Association    1         1      1
182                      Community & Southern Bank    1         1      1
416                                     F & M Bank    1         1      1
513                            Columbia State Bank    1         1      1
916                            State Bank of Texas    1         1      1
1006                                   No Acquirer    1         1      1
1056                        Regional Missouri Bank    1         1      1
1249                                 Far West Bank    1         1      1
1252                                   No Acquirer    1         1      1
1361                                  Metcalf Bank    1         1      1
1690                        Clayton Bank and Trust    1         1      1
1802                     United Fidelity Bank, fsb    1         1      1
1909                                  Central Bank    1         1      1
1971                                 Security Bank    1         1      1
2119                                   United Bank    1         1      1
2303                                        Bank 7    1         1      1
2994                            Bank Midwest, N.A.    1         1      1
3287                       Community National Bank    1         1      1
3644                    First Financial Bank, N.A.    1         1      1
3731              Heartland Bank and Trust Company    1         1      1
3735                                   Harris N.A.    1         1      1
3815                       Banterra Bank of Marion    1         1      1
4077                The Pauls Valley National Bank    1         1      1
4392                             Old National Bank    1         1      1
4614                                Bank of Kansas    1         1      1
4731                                   Arvest Bank    1         1      1
4744                       Enterprise Bank & Trust    1         1      1
4754                           Great Southern Bank    1         1      1
4862                                   Howard Bank    1         1      1
...                                            ...  ...       ...    ...
58072                             New Century Bank    1         1      1
58073                                    SmartBank    1         1      1
58087                        First California Bank    1         1      1
58104                                Bank of Upson    1         1      1
58125                    Community & Southern Bank    1         1      1
58182                              Centennial Bank    1         1      1
58185                                 Synovus Bank    1         1      1
58197                    Community & Southern Bank    1         1      1
58205                          Midland States Bank    1         1      1
58222                    SCBT National Association    1         1      1
58226                        Georgia Commerce Bank    1         1      1
58238                                  Ameris Bank    1         1      1
58241                           Stearns Bank, N.A.    1         1      1
58273                        Georgia Commerce Bank    1         1      1
58283                                  Xenith Bank    1         1      1
58302                                 Whitney Bank    1         1      1
58308                          First Southern Bank    1         1      1
58315                                  No Acquirer    1         1      1
58336                               Stonegate Bank    1         1      1
58343                                  Summit Bank    1         1      1
58352                      Heritage Bank of Nevada    1         1      1
58358                                   Plaza Bank    1         1      1
58362                                  BankLiberty    1         1      1
58399                      Enterprise Bank & Trust    1         1      1
58420  First Citizens Bank and Trust Company, Inc.    1         1      1
58429                         Wheaton Bank & Trust    1         1      1
58495               Peoples Bank of East Tennessee    1         1      1
58531                            First Choice Bank    1         1      1
58539                           Bank of the Ozarks    1         1      1
58701                           Capital Bank, N.A.    1         1      1

                                                         City        ...   \
                                               top freq count unique ...
CERT                                                                 ...
91                                     Allied Bank    1     1      1 ...
151                                 Habersham Bank    1     1      1 ...
182                               The Peoples Bank    1     1      1 ...
416                             First Capital Bank    1     1      1 ...
513                                    Summit Bank    1     1      1 ...
916          The National Republic Bank of Chicago    1     1      1 ...
1006                           Citizens State Bank    1     1      1 ...
1056                          Glasgow Savings Bank    1     1      1 ...
1249                               Bank of Ephraim    1     1      1 ...
1252                        Barnes Banking Company    1     1      1 ...
1361                                Heartland Bank    1     1      1 ...
1690                 The Farmers Bank of Lynchburg    1     1      1 ...
1802                           Fayette County Bank    1     1      1 ...
1909                               Mainstreet Bank    1     1      1 ...
1971                                     Hume Bank    1     1      1 ...
2119        The First National Bank of Barnesville    1     1      1 ...
2303                          The First State Bank    1     1      1 ...
2994                                Bank of Choice    1     1      1 ...
3287                    The La Coste National Bank    1     1      1 ...
3644               First National Bank of Danville    1     1      1 ...
3731                  Citizens First National Bank    1     1      1 ...
3735             Amcore Bank, National Association    1     1      1 ...
3815             National State Bank of Metropolis    1     1      1 ...
4077                  First National Bank of Davis    1     1      1 ...
4392             Integra Bank National Association    1     1      1 ...
4614                First National Bank of Anthony    1     1      1 ...
4731                                 SolutionsBank    1     1      1 ...
4744             The First National Bank of Olathe    1     1      1 ...
4754                                  TeamBank, NA    1     1      1 ...
4862                                NBRS Financial    1     1      1 ...
...                                            ...  ...   ...    ... ...
58072                                     USA Bank    1     1      1 ...
58073                       GulfSouth Private Bank    1     1      1 ...
58087                      Western Commercial Bank    1     1      1 ...
58104                        Century Security Bank    1     1      1 ...
58125                     Eastside Commercial Bank    1     1      1 ...
58182                            Old Southern Bank    1     1      1 ...
58185                                 Sunrise Bank    1     1      1 ...
58197                              Bank of Ellijay    1     1      1 ...
58205            WestBridge Bank and Trust Company    1     1      1 ...
58222                           BankMeridian, N.A.    1     1      1 ...
58226                               CreekSide Bank    1     1      1 ...
58238                             One Georgia Bank    1     1      1 ...
58241                           Alpha Bank & Trust    1     1      1 ...
58273                      Patriot Bank of Georgia    1     1      1 ...
58283                       Virginia Business Bank    1     1      1 ...
58302                               First NBC Bank    1     1      1 ...
58308                     Haven Trust Bank Florida    1     1      1 ...
58315                   RockBridge Commercial Bank    1     1      1 ...
58336                       Hillcrest Bank Florida    1     1      1 ...
58343  Premier Community Bank of the Emerald Coast    1     1      1 ...
58352                  Carson River Community Bank    1     1      1 ...
58358                            1st Commerce Bank    1     1      1 ...
58362                                Champion Bank    1     1      1 ...
58399                    Valley Capital Bank, N.A.    1     1      1 ...
58420                      Atlantic Bank and Trust    1     1      1 ...
58429                               Wheatland Bank    1     1      1 ...
58495              Appalachian Community Bank, FSB    1     1      1 ...
58531                           Vantage Point Bank    1     1      1 ...
58539                  First Choice Community Bank    1     1      1 ...
58701                        Pisgah Community Bank    1     1      1 ...

             Closing Date         ST                 Updated Date         \
                      top freq count unique top freq        count unique
CERT
91     September 23, 2016    1     1      1  AR    1            1      1
151     February 18, 2011    1     1      1  GA    1            1      1
182    September 17, 2010    1     1      1  GA    1            1      1
416          June 8, 2012    1     1      1  OK    1            1      1
513          May 20, 2011    1     1      1  WA    1            1      1
916      October 24, 2014    1     1      1  IL    1            1      1
1006    December 18, 2009    1     1      1  MI    1            1      1
1056        July 13, 2012    1     1      1  MO    1            1      1
1249        June 25, 2004    1     1      1  UT    1            1      1
1252     January 15, 2010    1     1      1  UT    1            1      1
1361        July 20, 2012    1     1      1  KS    1            1      1
1690        June 15, 2012    1     1      1  TN    1            1      1
1802         May 26, 2017    1     1      1  IL    1            1      1
1909      August 28, 2009    1     1      1  MN    1            1      1
1971        March 7, 2008    1     1      1  MO    1            1      1
2119     October 22, 2010    1     1      1  GA    1            1      1
2303     January 28, 2011    1     1      1  OK    1            1      1
2994        July 22, 2011    1     1      1  CO    1            1      1
3287    February 19, 2010    1     1      1  TX    1            1      1
3644         July 2, 2009    1     1      1  IL    1            1      1
3731     November 2, 2012    1     1      1  IL    1            1      1
3735       April 23, 2010    1     1      1  IL    1            1      1
3815    December 14, 2000    1     1      1  IL    1            1      1
4077       March 11, 2011    1     1      1  OK    1            1      1
4392        July 29, 2011    1     1      1  IN    1            1      1
4614        June 19, 2009    1     1      1  KS    1            1      1
4731    December 11, 2009    1     1      1  KS    1            1      1
4744      August 12, 2011    1     1      1  KS    1            1      1
4754       March 20, 2009    1     1      1  KS    1            1      1
4862     October 17, 2014    1     1      1  MD    1            1      1
...                   ...  ...   ...    ...  ..  ...          ...    ...
58072        July 9, 2010    1     1      1  NY    1            1      1
58073    October 19, 2012    1     1      1  FL    1            1      1
58087    November 5, 2010    1     1      1  CA    1            1      1
58104      March 19, 2010    1     1      1  GA    1            1      1
58125       July 18, 2014    1     1      1  GA    1            1      1
58182      March 12, 2010    1     1      1  FL    1            1      1
58185        May 10, 2013    1     1      1  GA    1            1      1
58197  September 17, 2010    1     1      1  GA    1            1      1
58205    October 15, 2010    1     1      1  MO    1            1      1
58222       July 29, 2011    1     1      1  SC    1            1      1
58226   September 2, 2011    1     1      1  GA    1            1      1
58238       July 15, 2011    1     1      1  GA    1            1      1
58241    October 24, 2008    1     1      1  GA    1            1      1
58273   September 2, 2011    1     1      1  GA    1            1      1
58283       July 29, 2011    1     1      1  VA    1            1      1
58302      April 28, 2017    1     1      1  LA    1            1      1
58308  September 24, 2010    1     1      1  FL    1            1      1
58315   December 18, 2009    1     1      1  GA    1            1      1
58336    October 23, 2009    1     1      1  FL    1            1      1
58343   December 16, 2011    1     1      1  FL    1            1      1
58352   February 26, 2010    1     1      1  NV    1            1      1
58358        June 6, 2013    1     1      1  NV    1            1      1
58362      April 30, 2010    1     1      1  MO    1            1      1
58399   December 11, 2009    1     1      1  AZ    1            1      1
58420        June 3, 2011    1     1      1  SC    1            1      1
58429      April 23, 2010    1     1      1  IL    1            1      1
58495   December 17, 2010    1     1      1  GA    1            1      1
58531   February 28, 2014    1     1      1  PA    1            1      1
58539      April 29, 2011    1     1      1  GA    1            1      1
58701        May 10, 2013    1     1      1  NC    1            1      1


                      top freq
CERT
91      November 17, 2016    1
151        March 21, 2014    1
182           May 4, 2016    1
416      February 5, 2015    1
513      January 22, 2013    1
916       January 6, 2016    1
1006       March 21, 2014    1
1056      August 19, 2014    1
1249        April 9, 2008    1
1252      August 23, 2012    1
1361        July 30, 2013    1
1690       August 8, 2016    1
1802         June 1, 2017    1
1909      August 21, 2012    1
1971      August 28, 2012    1
2119     October 17, 2015    1
2303   September 12, 2012    1
2994   September 12, 2012    1
3287      August 19, 2014    1
3644      August 20, 2012    1
3731    November 22, 2013    1
3735      August 23, 2012    1
3815       March 17, 2005    1
4077       April 13, 2017    1
4392      August 16, 2012    1
4614   September 21, 2015    1
4731        July 19, 2016    1
4744      August 23, 2012    1
4754   September 12, 2016    1
4862       March 26, 2015    1
...                   ...  ...
58072  September 14, 2012    1
58073      March 21, 2014    1
58087  September 12, 2016    1
58104      April 13, 2016    1
58125       July 11, 2016    1
58182    February 9, 2017    1
58185       June 26, 2014    1
58197        June 6, 2016    1
58205    February 9, 2017    1
58222      March 21, 2014    1
58226      March 21, 2014    1
58238      March 21, 2014    1
58241     August 16, 2012    1
58273      March 21, 2014    1
58283     October 9, 2012    1
58302        May 23, 2017    1
58308       July 11, 2016    1
58315      March 21, 2014    1
58336     August 22, 2012    1
58343      March 21, 2014    1
58352    January 15, 2013    1
58358       July 12, 2013    1
58362        June 6, 2016    1
58399    October 20, 2016    1
58420      March 21, 2014    1
58429     August 23, 2012    1
58495      March 21, 2014    1
58531       March 3, 2015    1
58539  September 21, 2015    1
58701      August 8, 2016    1

[553 rows x 24 columns]

# Aus Excel

In [6]:
df = pd.read_excel('Mappe1.xlsx',sheetname='Tabelle1')

In [11]:
df[4].sum()

44

# Nach Excel

In [117]:
# df.to_excel('Mappe1Neu.xlsx', sheet_name='Tabelle3')
import xlsxwriter

xlsxwriter.

# Aus CSV

In [ ]:
df = pd.read_csv('Mappe1.csv', sep=';', decimal=',')
df

In [105]:
df = pd.read_csv('strange.csv', sep=';', decimal=',')
df

0    4
Name: "2;", dtype: int64

# Nach CSV

In [ ]:
df.to_csv('Mappe1Neu.csv', sep=';', decimal=',')

# SQL

In [122]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')
df.to_sql('data', engine)
sql_df = pd.read_sql('data', con=engine)
sql_df

   index  1;  "2;"  3
0      0   4     4  5

In [123]:
import sqlalchemy
engine = create_engine('mysql://pcdb:pcdb@192.168.254.158:3306/pcdb')
sql_df = pd.read_sql('select * from pcdb_puppet_factsets', con=engine)
sql_df

,pcdb_puppet_factsets_id,fk_pcdb_puppet_environments_id,fk_pcdb_stammdaten_id,last_pcdb_imports_id,factsets_certname,factsets_hash,factsets_timestamp,factsets_producer_timestamp,date_added,date_last_modified
0,1,1,1,133,hyper.sgl,b'febcb562d514b36981c98ac150928bba14bb47bb',2017-04-20 07:58:05,2017-04-20 07:58:05,2017-04-03 15:23:49,2017-04-20 10:04:30
1,2,1,2,133,puppet.sgl,b'05909d8626ab50fd7bc9cfdafb311ad990e8ab64',2017-04-20 07:58:10,2017-04-20 07:58:10,2017-04-03 15:23:50,2017-04-20 10:04:31
2,3,2,3,133,narnia.sgl,b'd1d15c4e3216eeadca198b3fd569245ae326feda',2017-04-20 07:56:12,2017-04-20 07:56:12,2017-04-03 15:23:50,2017-04-20 10:04:28

# JSON

In [124]:
sql_df.to_json()

'{"pcdb_puppet_factsets_id":{"0":1,"1":2,"2":3},"fk_pcdb_puppet_environments_id":{"0":1,"1":1,"2":2},"fk_pcdb_stammdaten_id":{"0":1,"1":2,"2":3},"last_pcdb_imports_id":{"0":133,"1":133,"2":133},"factsets_certname":{"0":"hyper.sgl","1":"puppet.sgl","2":"narnia.sgl"},"factsets_hash":{"0":"febcb562d514b36981c98ac150928bba14bb47bb","1":"05909d8626ab50fd7bc9cfdafb311ad990e8ab64","2":"d1d15c4e3216eeadca198b3fd569245ae326feda"},"factsets_timestamp":{"0":1492675085000,"1":1492675090000,"2":1492674972000},"factsets_producer_timestamp":{"0":1492675085000,"1":1492675090000,"2":1492674972000},"date_added":{"0":1491233029000,"1":1491233030000,"2":1491233030000},"date_last_modified":{"0":1492682670000,"1":1492682671000,"2":1492682668000}}'

# Dictionary

In [125]:
sql_df.to_dict()

{'date_added': {0: Timestamp('2017-04-03 15:23:49'),
  1: Timestamp('2017-04-03 15:23:50'),
  2: Timestamp('2017-04-03 15:23:50')},
 'date_last_modified': {0: Timestamp('2017-04-20 10:04:30'),
  1: Timestamp('2017-04-20 10:04:31'),
  2: Timestamp('2017-04-20 10:04:28')},
 'factsets_certname': {0: 'hyper.sgl', 1: 'puppet.sgl', 2: 'narnia.sgl'},
 'factsets_hash': {0: b'febcb562d514b36981c98ac150928bba14bb47bb',
  1: b'05909d8626ab50fd7bc9cfdafb311ad990e8ab64',
  2: b'd1d15c4e3216eeadca198b3fd569245ae326feda'},
 'factsets_producer_timestamp': {0: Timestamp('2017-04-20 07:58:05'),
  1: Timestamp('2017-04-20 07:58:10'),
  2: Timestamp('2017-04-20 07:56:12')},
 'factsets_timestamp': {0: Timestamp('2017-04-20 07:58:05'),
  1: Timestamp('2017-04-20 07:58:10'),
  2: Timestamp('2017-04-20 07:56:12')},
 'fk_pcdb_puppet_environments_id': {0: 1, 1: 1, 2: 2},
 'fk_pcdb_stammdaten_id': {0: 1, 1: 2, 2: 3},
 'last_pcdb_imports_id': {0: 133, 1: 133, 2: 133},
 'pcdb_puppet_factsets_id': {0: 1, 1: 2, 2: 3}}